In [1]:
from sqlalchemy import create_engine, inspect
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
import pandas as pd

In [2]:
engine = create_engine('postgresql://postgres:postgres@localhost:5432/school_db')
conn = engine.connect()
session = Session(engine)

In [3]:
# Able to connect to the DB and import a table into Pandas
data = pd.read_sql("SELECT * FROM school_distinctive_programs", conn)
data.head()

,school_name,alp_domain,alp_title,llp_domain1,llp_title1,llp_domain2,llp_title2
0,ADMIRALTY PRIMARY SCHOOL,STEM,Design Thinking for Sustainability (DTS @ Admi...,Community Service & Student Leadership,High Performance Mind-set for Personal Leadership,NULL,NULL
1,ADMIRALTY SECONDARY SCHOOL,STEM,Design Thinking Through Innovation and Technology,Community & Youth Leadership,Nurturing Mindful Leaders through Community Ou...,NULL,NULL
2,AHMAD IBRAHIM PRIMARY SCHOOL,Science,Sustainability Education ? Nurturing Students ...,Community Service & Student Leadership,From Values to Action - Nurturing Community-Ba...,NULL,NULL
3,AHMAD IBRAHIM SECONDARY SCHOOL,Languages & Humanities,Critical Social Inquiry and Media Literacy,Sports & Outdoor Education,Character Development through Outdoor Learning...,NULL,NULL
4,AI TONG SCHOOL,NULL,NULL,Music & Performing Arts,Caring through ARTS,Sports & Outdoor Education,Character and Leadership Development through O...

In [4]:
data_refined3_df = data.loc[data['alp_domain'] == 'STEM', :]
data_refined3_df

,school_id,school_name,alp_domain,alp_title,llp_domain1,llp_title1
0,0,ADMIRALTY PRIMARY SCHOOL,STEM,Design Thinking for Sustainability (DTS @ Admi...,Community Service & Student Leadership,High Performance Mind-set for Personal Leadership
1,1,ADMIRALTY SECONDARY SCHOOL,STEM,Design Thinking Through Innovation and Technology,Community & Youth Leadership,Nurturing Mindful Leaders through Community Ou...
2,9,ANG MO KIO SECONDARY SCHOOL,STEM,Environment Science & Technology,Music & Performing Arts,Integrated Arts Programme
3,15,BARTLEY SECONDARY SCHOOL,STEM,Chemical and Life Sciences (Perfumery),Community & Youth Leadership,i-LEAD @ Bartley (Leadership Experience and De...
4,17,BEATTY SECONDARY SCHOOL,STEM,Beattyians Think. Create. Innovate,Community & Youth Leadership,Beatty's Leaders for Life Programme
...,...,...,...,...,...,...
66,278,YUAN CHING SECONDARY SCHOOL,STEM,Marine Robotics,Sports & Outdoor Education,gRowing Values through Sports and Outdoor Educ...
67,280,YUHUA SECONDARY SCHOOL,STEM,"Coding, Design, Thinking and Robotics (CODER)",Music & Performing Arts,"MELODY- Music Empowered Learners, Our Dynamic ..."
68,282,YUSOF ISHAK SECONDARY SCHOOL,STEM,"Programme for Authentic Science, Technology an...",Music & Performing Arts / Visual Arts & Design,H2eArts in Tune Programme: History & Heritage ...
69,286,ZHENGHUA SECONDARY SCHOOL,STEM,Game Design and Simulation and Robotics,Sports & Outdoor Education,Outdoor Education for Character & Leadership D...
70,287,ZHONGHUA PRIMARY SCHOOL,STEM,ZPS STE(A)M ? Thinknovate,Community Service & Student Leadership,Green Education Movement @ Zhonghua Primary Sc...

In [5]:
inspector = inspect(engine)

In [6]:
inspector.get_columns('school_distinctive_programs')

[{'name': 'school_name',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'alp_domain',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'alp_title',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'llp_domain1',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'llp_title1',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'llp_domain2',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'llp_title2',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None}]

In [7]:
Base = automap_base()
Base.prepare(engine, reflect=True)
SLP = Base.classes.school_distinctive_programs
GIOS = Base.classes.general_information_of_schools

In [8]:
# Query for All the distinct STEM schools
stem_schools = session.query( SLP.school_name, SLP.alp_domain ).\
    filter( SLP.alp_domain == 'STEM')

# stem_schools.all()
# Creating a list of all the schools
school_list = []
for school in stem_schools:
    school_list.append(school[0])

school_list

['ADMIRALTY PRIMARY SCHOOL',
 'ADMIRALTY SECONDARY SCHOOL',
 'ANG MO KIO SECONDARY SCHOOL',
 'BARTLEY SECONDARY SCHOOL',
 'BEATTY SECONDARY SCHOOL',
 'BEDOK GREEN SECONDARY SCHOOL',
 'BENDEMEER SECONDARY SCHOOL',
 'BLANGAH RISE PRIMARY SCHOOL',
 'BOON LAY SECONDARY SCHOOL',
 'BROADRICK SECONDARY SCHOOL',
 'BUKIT BATOK SECONDARY SCHOOL',
 'BUKIT MERAH SECONDARY SCHOOL',
 'BUKIT VIEW SECONDARY SCHOOL',
 'CHANGKAT CHANGI SECONDARY SCHOOL',
 'CHANGKAT PRIMARY SCHOOL',
 'CHRIST CHURCH SECONDARY SCHOOL',
 'CHUA CHU KANG SECONDARY SCHOOL',
 'CHUNG CHENG HIGH SCHOOL (YISHUN)',
 'CLEMENTI TOWN SECONDARY SCHOOL',
 'COMPASSVALE SECONDARY SCHOOL',
 'DAMAI SECONDARY SCHOOL',
 'DUNEARN SECONDARY SCHOOL',
 'EAST SPRING SECONDARY SCHOOL',
 'FAJAR SECONDARY SCHOOL',
 'FUCHUN SECONDARY SCHOOL',
 'FUHUA SECONDARY SCHOOL',
 'GAN ENG SENG SCHOOL',
 'GEYLANG METHODIST SCHOOL (SECONDARY)',
 'GREENDALE SECONDARY SCHOOL',
 'GUANGYANG SECONDARY SCHOOL',
 'HAI SING CATHOLIC SCHOOL',
 'HILLGROVE SECONDARY SCHOOL',
 'HUA YI SECONDARY SCHOOL',
 'JUNYUAN SECONDARY SCHOOL',
 'JURONGVILLE SECONDARY SCHOOL',
 'KENT RIDGE SECONDARY SCHOOL',
 'LOYANG VIEW SECONDARY SCHOOL',
 'MANJUSRI SECONDARY SCHOOL',
 'MARSILING SECONDARY SCHOOL',
 'MONTFORT SECONDARY SCHOOL',
 'NAN CHIAU HIGH SCHOOL',
 'NORTH VISTA SECONDARY SCHOOL',
 'NORTHBROOKS SECONDARY SCHOOL',
 'NORTHLAND SECONDARY SCHOOL',
 'PEI HWA SECONDARY SCHOOL',
 'PEICAI SECONDARY SCHOOL',
 'PING YI SECONDARY SCHOOL',
 'PRESBYTERIAN HIGH SCHOOL',
 'PUNGGOL SECONDARY SCHOOL',
 'QUEENSWAY SECONDARY SCHOOL',
 'REGENT SECONDARY SCHOOL',
 'SENG KANG SECONDARY SCHOOL',
 'SERANGOON SECONDARY SCHOOL',
 'SPRINGFIELD SECONDARY SCHOOL',
 "ST. ANDREW'S SECONDARY SCHOOL",
 "ST. ANTHONY'S PRIMARY SCHOOL",
 "ST. GABRIEL'S SECONDARY SCHOOL",
 "ST. PATRICK'S SCHOOL",
 'SWISS COTTAGE SECONDARY SCHOOL',
 'TAMPINES SECONDARY SCHOOL',
 'TECK WHYE SECONDARY SCHOOL',
 'UNITY SECONDARY SCHOOL',
 'WOODGROVE SECONDARY SCHOOL',
 'WOODLANDS RING SECONDARY SCHOOL',
 'WOODLANDS SECONDARY SCHOOL',
 'YIO CHU KANG SECONDARY SCHOOL',
 'YUAN CHING SECONDARY SCHOOL',
 'YUHUA SECONDARY SCHOOL',
 'YUSOF ISHAK SECONDARY SCHOOL',
 'ZHENGHUA SECONDARY SCHOOL',
 'ZHONGHUA PRIMARY SCHOOL']

In [9]:
titles = pd.DataFrame(
    {
        "employee_title": ["Principal", "VP"]
    }
)
titles.to_sql("titles", conn, index=True, index_label="title_id")

ValueError: Table 'titles' already exists.

In [10]:
# Transforming the columns in GIOP for a "Titles" table
admin_data = session.query( GIOS.school_name, GIOS.principal_name, GIOS.first_vp_name, GIOS.second_vp_name, GIOS.third_vp_name, GIOS.fourth_vp_name, GIOS.fifth_vp_name, GIOS.sixth_vp_name )

# Creating a list to create a data frame
admin_list = []

# Commands to look at the data from the query
# admin_data.all()
# admin_data[0]


for admin in admin_data:
    s = admin[0]
    # print(s)
    for x in range(1, 8):
        person = []
        a = admin[x]
        if x == 1:
            t = '0'
        if x > 1:
            t = '1'
        if admin[x] == 'NULL':
            break        
        person.append(admin[0])
        person.append(a)
        person.append(t)
        admin_list.append(person)

admin_table = pd.DataFrame(admin_list, columns=["school_name", 'name', 'title'])
admin_table.to_sql("admins", conn)
# Checking to see that all Six VPs got into the table
# admin_table.loc[admin_table[0] == 'RAFFLES INSTITUTION']

ValueError: Table 'admins' already exists.

In [123]:
# Transforming the columns in GIOP for a "Mother Tongue" table
mt_data = session.query( GIOS.school_name, GIOS.mothertongue1_code, GIOS.mothertongue2_code, GIOS.mothertongue3_code )

mother_tongue_data = []

for mt in mt_data:
    s = mt[0]
    # print(s)
    for x in range(1, 4):
        tongue = []
        a = mt[x]
        if mt[x] == 'na':
            break        
        tongue.append(mt[0])
        tongue.append(a)
        mother_tongue_data.append(tongue)

mt_df = pd.DataFrame(mother_tongue_data, columns=['school_name', 'mothertongue_code'])
mt_df

                    school_name mothertongue_code
0      ADMIRALTY PRIMARY SCHOOL           Chinese
1      ADMIRALTY PRIMARY SCHOOL             Malay
2      ADMIRALTY PRIMARY SCHOOL             Tamil
3    ADMIRALTY SECONDARY SCHOOL           Chinese
4    ADMIRALTY SECONDARY SCHOOL             Malay
..                          ...               ...
961     ZHONGHUA PRIMARY SCHOOL           Chinese
962     ZHONGHUA PRIMARY SCHOOL             Malay
963     ZHONGHUA PRIMARY SCHOOL             Tamil
964   ZHONGHUA SECONDARY SCHOOL           Chinese
965   ZHONGHUA SECONDARY SCHOOL             Malay

[966 rows x 2 columns]

In [139]:
prg_data = session.query( SLP.school_name, SLP.alp_domain, SLP.alp_title, SLP.llp_domain1, SLP.llp_title1, SLP.llp_domain2, SLP.llp_title2 )


for admin in prg_data:
    s = admin[0]
    # print(s)
    for x in range(1, 8):
        person = []
        a = admin[x]
        if x == 1:
            t = 'Principal'
        if x > 1:
            t = 'Vice Principal'
        if admin[x] == 'NULL':
            break        
        person.append(admin[0])
        person.append(a)
        person.append(t)
        admin_list.append(person)

In [8]:
data_refined3_df.to_sql("general_school_info", conn)

In [ ]:
# TODO list:
# Clean up new tables
# Match existing data with general table (alp and other columns)
# Replace school_name with school_id in certain tables
# Drop old Tables. Export all tables and data to SQL
# Update DB Diagram with new table structure